test/performance_results/thread_1_2.txt
Running 10s test @ http://127.0.0.1:8080/
  1 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.60ms  208.08ms   1.97s    89.22%
    Req/Sec     1.89k     3.92k   13.21k    86.21%
  5725 requests in 14.29s, 578.99KB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:    400.49
Transfer/sec:     40.50KB